IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G2_EPWM28_CONTROLSS_G2_EPWM28.xml
<module name="CONTROLSS_G2_EPWM28_CONTROLSS_G2_EPWM" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CONTROLSS_G2_EPWM28_TBCTL" acronym="CONTROLSS_G2_EPWM28_TBCTL" offset="0x0" width="16" description="Time Base Control Register">
		<bitfield id="FREE_SOFT" width="2" begin="15" end="14" resetval="0x0" description="Emulation Mode Bits. These bits select the behavior of the ePWM time-base counter during emulation events   00: Stop after the next time-base counter increment or decrement  01: Stop when counter completes a whole cycle:  - Up-count mode: stop when the time-base counter = period [TBCTR = TBPRD]  - Down-count mode: stop when the time-base counter = 0x00 [TBCTR = 0x00]  - Up-down-count mode: stop when the time-base counter = 0x00 [TBCTR = 0x00]  1x: Free run" range="15 - 14" rwaccess="R/W"/> 
		<bitfield id="PHSDIR" width="1" begin="13" end="13" resetval="0x0" description="Phase Direction Bit  This bit is only used when the time-base counter is configured in the up-down-count mode. The PHSDIR bit indicates the direction the time-base counter [TBCTR] will count after a synchronization event occurs and a new phase value is loaded from the phase [TBPHS] register. This is irrespective of the direction of the counter before the synchronization event.. In the up-count and down-count modes this bit is ignored.   0: Count down after the synchronization event.  1: Count up after the synchronization event." range="13" rwaccess="R/W"/> 
		<bitfield id="CLKDIV" width="3" begin="12" end="10" resetval="0x0" description="Time Base Clock Pre-Scale Bits  These bits select the time base clock pre-scale value [TBCLK = EPWMCLK/[HSPCLKDIV * CLKDIV]:   000: /1 [default on reset]  001: /2  010: /4  011: /8  100: /16  101: /32  110: /64  111: /128" range="12 - 10" rwaccess="R/W"/> 
		<bitfield id="HSPCLKDIV" width="3" begin="9" end="7" resetval="0x1" description="High Speed Time Base Clock Pre-Scale Bits  These bits determine part of the time-base clock prescale value. TBCLK = EPWMCLK / [HSPCLKDIV x CLKDIV]. This divisor emulates the HSPCLK in the TMS320x281x system as used on the Event Manager [EV] peripheral.   000: /1  001: /2 [default on reset]  010: /4  011: /6  100: /8  101: /10  110: /12  111: /14" range="9 - 7" rwaccess="R/W"/> 
		<bitfield id="SWFSYNC" width="1" begin="6" end="6" resetval="0x0" description="Software Forced Sync Pulse   0: Writing a 0 has no effect and reads always return a 0.  1: Writing a 1 forces a one-time synchronization pulse to be generated. SWFSYNC can be enabled to affect EPWMxSYNCO by setting the EPWMSYNCOUTEN.SWEN bit." range="6" rwaccess="R/W1TS"/> 
		<bitfield id="PRDLD" width="1" begin="3" end="3" resetval="0x0" description="Active Period Reg Load from Shadow Select   0: The period register [TBPRD] is loaded from its shadow register when the time-base counter, TBCTR, is equal to zero and/or a sync event as determined by the TBCTL2[PRDLDSYNC] bit.  A write/read to the TBPRD register accesses the shadow register.   1:  Immediate Mode [Shadow register bypassed]:  A write or read to the TBPRD register accesses the active register." range="3" rwaccess="R/W"/> 
		<bitfield id="PHSEN" width="1" begin="2" end="2" resetval="0x0" description="Counter Reg Load from Phase Reg Enable   0: Do not load the time-base counter [TBCTR] from the time-base phase register [TBPHS].  1: Allow Counter to be loaded from the Phase register [TBPHS] and shadow to active load events when an EPWMxSYNCI input signal occurs or a software-forced sync signal, see bit 6." range="2" rwaccess="R/W"/> 
		<bitfield id="CTRMODE" width="2" begin="1" end="0" resetval="0x3" description="Counter Mode  The time-base counter mode is normally configured once and not changed during normal operation. If you change the mode of the counter, the change will take effect at the next TBCLK edge and the current counter value shall increment or decrement from the value before the mode change. These bits set the time-base counter mode of operation as follows:  00: Up-count mode  01: Down-count mode  10: Up-down count mode  11: Freeze counter operation [default on reset]" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM28_TBCTL2" acronym="CONTROLSS_G2_EPWM28_TBCTL2" offset="0x2" width="16" description="Time Base Control Register 2">
		<bitfield id="PRDLDSYNC" width="2" begin="15" end="14" resetval="0x0" description="Shadow to Active Period Register Load on SYNC event   00: Shadow to Active Load of TBPRD occurs only when TBCTR = 0 [same as legacy].  01: Shadow to Active Load of TBPRD occurs both when TBCTR = 0 and when SYNC occurs.  10: Shadow to Active Load of TBPRD occurs only when a SYNC is received.  11: Reserved  Note: This bit selection is valid only if TBCTL[PRDLD]=0." range="15 - 14" rwaccess="R/W"/> 
		<bitfield id="OSHTSYNC" width="1" begin="7" end="7" resetval="0x0" description="Oneshot sync bit   0: Writing a '0' has no effect.  1: Allow one sync pulse to propogate." range="7" rwaccess="R/W1TS"/> 
		<bitfield id="OSHTSYNCMODE" width="1" begin="6" end="6" resetval="0x0" description="Oneshot sync enable bit   0: Oneshot sync mode disabled  1: Oneshot sync mode enabled" range="6" rwaccess="R/W"/> 
		<bitfield id="SELFCLRTRREM" width="1" begin="5" end="5" resetval="0x0" description="Loop back sync pulse to enable self sync operation   0: Self clear function of TRREM disabled.  1: Self clear function of TRREM enabled" range="5" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM28_EPWMSYNCINSEL" acronym="CONTROLSS_G2_EPWM28_EPWMSYNCINSEL" offset="0x6" width="16" description="EPWMxSYNCIN Source Select Register">
		<bitfield id="SEL" width="7" begin="6" end="0" resetval="0x1" description="These bits determine the source of the EPWMxSYNCI signal 0x0: Disabled 0x01: EPWM0.SYNCOUT . 0x10: EPWM15.SYNCOUT 0x11:EPWM16.SYNCOUT . 0x20: EPWM31.SYNCOUT 0x21: Reserved . 0x40: ECAP0.SYNCOUT . 0x49: ECAP9.SYNCPUT 0x4A: Reserved . 0x4F: Reserved 0x50: InputXBar.Out[4] 0x51: InputXBar.Out[20] 0x52: Reserved . 0x57: Reserved 0x58: C2K_TimeSyncXBar..SYNCPWMOut0 0x59: C2K_TimeSyncXBar..SYNCPWMOut1 0x5A: Reserved 0x5F: Reserved 0x60: FSIRX0.RXTRIG[0] 0x61: FSIRX0.RXTRIG[1] 0x62: FSIRX0.RXTRIG[2] 0x63: FSIRX0.RXTRIG[3] 0x64: FSIRX1.RXTRIG[0] 0x65: FSIRX1.RXTRIG[1] 0x66: FSIRX1.RXTRIG[2] 0x67: FSIRX1.RXTRIG[3] 0x68: FSIRX2.RXTRIG[0] 0x69: FSIRX2.RXTRIG[1] 0x6A: FSIRX2.RXTRIG[2] 0x6B: FSIRX2.RXTRIG[3] 0x6C: FSIRX3.RXTRIG[0] 0x6D: FSIRX3.RXTRIG[1] 0x6E: FSIRX3.RXTRIG[2] 0x6F: FSIRX3.RXTRIG[3] 0x70: Reserved . 0x7F: Reserved" range="6 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM28_TBCTR" acronym="CONTROLSS_G2_EPWM28_TBCTR" offset="0x8" width="16" description="Time Base Counter Register">
		<bitfield id="TBCTR" width="16" begin="15" end="0" resetval="0x0" description="Time Base Counter Register" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM28_TBSTS" acronym="CONTROLSS_G2_EPWM28_TBSTS" offset="0xA" width="16" description="Time Base Status Register">
		<bitfield id="CTRMAX" width="1" begin="2" end="2" resetval="0x0" description="Time-Base Counter Max Latched Status Bit   0: Reading a 0 indicates the time-base counter never reached its maximum value. Writing a 0 will have no effect.  1: Reading a 1 on this bit indicates that the time-base counter reached the max value 0xFFFF. Writing a 1 to this bit will clear the latched event." range="2" rwaccess="R/W1TC"/> 
		<bitfield id="SYNCI" width="1" begin="1" end="1" resetval="0x0" description="Input Synchronization Latched Status Bit   0: Writing a 0 will have no effect. Reading a 0 indicates no external synchronization event has occurred.  1: Reading a 1 on this bit indicates that an external synchronization event has occurred [EPWMxSYNCI]. Writing a 1 to this bit will clear the latched event." range="1" rwaccess="R/W1TC"/> 
		<bitfield id="CTRDIR" width="1" begin="0" end="0" resetval="0x1" description="Time Base Counter Direction Status Bit   0: Time-Base Counter is currently counting down.  1: Time-Base Counter is currently counting up.  Note: This bit is only valid when the counter is not frozen." range="0" rwaccess="R"/>
	</register>
	<register id="CONTROLSS_G2_EPWM28_EPWMSYNCOUTEN" acronym="CONTROLSS_G2_EPWM28_EPWMSYNCOUTEN" offset="0xC" width="16" description="EPWMxSYNCOUT Source Enable Register">
		<bitfield id="DCBEVT1EN" width="1" begin="6" end="6" resetval="0x0" description="This bit enables the DCBEVT1.sync event to set the EPWMxSYNCO signal.   0  Disabled   1  The EPWMxSYNCO signal is pulsed for one PWM clock period upon a DCBEVT1.sync event" range="6" rwaccess="R/W"/> 
		<bitfield id="DCAEVT1EN" width="1" begin="5" end="5" resetval="0x0" description="This bit enables the DCAEVT1.sync event to set the EPWMxSYNCOUT signal.   0  Disabled   1  The EPWMxSYNCOUT signal is pulsed for one PWM clock period upon a DCAEVT1.sync event" range="5" rwaccess="R/W"/> 
		<bitfield id="CMPDEN" width="1" begin="4" end="4" resetval="0x0" description="This bit enables the TBCTR = CMPD event to set the EPWMxSYNCO signal.   0  Disabled   1  The EPWMxSYNCO signal is pulsed for one PWM clock period upon a time-base counter equal to counter compare D event [TBCTR = CMPD]" range="4" rwaccess="R/W"/> 
		<bitfield id="CMPCEN" width="1" begin="3" end="3" resetval="0x0" description="This bit enables the TBCTR = CMPC event to set the EPWMxSYNCO signal.   0  Disabled   1  The EPWMxSYNCO signal is pulsed for one PWM clock period upon a time-base counter equal to counter compare C event [TBCTR = CMPC]" range="3" rwaccess="R/W"/> 
		<bitfield id="CMPBEN" width="1" begin="2" end="2" resetval="0x0" description="This bit enables the TBCTR = CMPB event to set the EPWMxSYNCO signal.   0  Disabled   1  The EPWMxSYNCO signal is pulsed for one PWM clock period upon a time-base counter equal to counter compare B event [TBCTR = CMPB]" range="2" rwaccess="R/W"/> 
		<bitfield id="ZEROEN" width="1" begin="1" end="1" resetval="0x0" description="This bit enables the TBCTR = 0x0000 event to set the EPWMxSYNCOUT signal.   0  Disabled   1  The EPWMxSYNCOUT signal is pulsed for one PWM clock period upon the value of TBCTR changing to 0x0000" range="1" rwaccess="R/W"/> 
		<bitfield id="SWEN" width="1" begin="0" end="0" resetval="0x1" description="This bit enables the TBCTL.SWFSYNC bit to set the EPWMxSYNCO signal.   0  Disabled   1  The EPWMxSYNCO signal is pulsed for one PWM clock period when the TBCTL.SWFSYNC bit is set" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM28_TBCTL3" acronym="CONTROLSS_G2_EPWM28_TBCTL3" offset="0xE" width="16" description="Time Base Control Register 3">
		<bitfield id="OSSFRCEN" width="1" begin="0" end="0" resetval="0x0" description="This bit determines which bit sets the EPWMxSYNCOUT One Shot Latch.   0  TBCTL2[OSHTSYNC] sets the One Shot Latch   1  GLDCTL2[OSHTLD] sets the One Shot Latch" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM28_CMPCTL" acronym="CONTROLSS_G2_EPWM28_CMPCTL" offset="0x10" width="16" description="Counter Compare Control Register">
		<bitfield id="LINKDUTYHR" width="1" begin="15" end="15" resetval="0x0" description="CMPAHR, CMPBHR Register Linking:  0 PWMA and PWMB outputs generated independently and CMPAHR, CMPBHR are independent values as on Type-4 1 When this bit is set CMPBHR assumes the same value as CMPAHR. This is typically used in complimentary PWM output generation    [Section 7 details of the operation]" range="15" rwaccess="R/W"/> 
		<bitfield id="LOADBSYNC" width="2" begin="13" end="12" resetval="0x0" description="Shadow to Active CMPB Register Load on SYNC event   00: Shadow to Active Load of CMPB:CMPBHR occurs according to LOADBMODE [bits 1,0] [same as legacy]  01: Shadow to Active Load of CMPB:CMPBHR occurs both according to LOADBMODE bits and when SYNC occurs  10: Shadow to Active Load of CMPB:CMPBHR occurs only when a SYNC is received  11: Reserved  Note: This bit is valid only if CMPCTL[SHDWBMODE] = 0." range="13 - 12" rwaccess="R/W"/> 
		<bitfield id="LOADASYNC" width="2" begin="11" end="10" resetval="0x0" description="Shadow to Active CMPA Register Load on SYNC event   00: Shadow to Active Load of CMPA:CMPAHR occurs according to LOADAMODE [bits 1,0] [same as legacy]  01: Shadow to Active Load of CMPA:CMPAHR occurs both according to LOADAMODE bits and when SYNC occurs  10: Shadow to Active Load of CMPA:CMPAHR occurs only when a SYNC is received  11: Reserved  Note: This bit is valid only if CMPCTL[SHDWAMODE] = 0." range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="SHDWBFULL" width="1" begin="9" end="9" resetval="0x0" description="Counter-compare B [CMPB] Shadow Register Full Status Flag  This bit self clears once a loadstrobe occurs.   0: CMPB shadow FIFO not full yet  1: Indicates the CMPB shadow FIFO is full  a CPU write will overwrite current shadow value" range="9" rwaccess="R"/> 
		<bitfield id="SHDWAFULL" width="1" begin="8" end="8" resetval="0x0" description="Counter-compare A [CMPA] Shadow Register Full Status Flag  The flag bit is set when a 32-bit write to CMPA:CMPAHR register or a 16-bit write to CMPA register is made. A 16-bit write to CMPAHR register will not affect the flag. This bit self clears once a load-strobe occurs.   0: CMPA shadow FIFO not full yet  1: Indicates the CMPA shadow FIFO is full, a CPU write will overwrite the current shadow value" range="8" rwaccess="R"/> 
		<bitfield id="SHDWBMODE" width="1" begin="6" end="6" resetval="0x0" description="Counter-compare B [CMPB] Register Operating Mode   0: Shadow mode. Operates as a double buffer. All writes via the CPU access the shadow register  1: Immediate mode. Only the active compare B register is used. All writes and reads directly access the active register for immediate compare action" range="6" rwaccess="R/W"/> 
		<bitfield id="SHDWAMODE" width="1" begin="4" end="4" resetval="0x0" description="Counter-compare A [CMPA] Register Operating Mode   0: Shadow mode. Operates as a double buffer. All writes via the CPU access the shadow register  1: Immediate mode. Only the active compare register is used. All writes and reads directly access the active register for immediate compare action" range="4" rwaccess="R/W"/> 
		<bitfield id="LOADBMODE" width="2" begin="3" end="2" resetval="0x0" description="Active Counter-Compare B [CMPB] Load From Shadow Select Mode  This bit has no effect in immediate mode [CMPCTL[SHDWBMODE] = 1].   00: Load on CTR = Zero: Time-base counter equal to zero [TBCTR = 0x0000]  01: Load on CTR = PRD: Time-base counter equal to period [TBCTR = TBPRD]  10: Load on either CTR = Zero or CTR = PRD  11: Freeze [no loads possible]" range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="LOADAMODE" width="2" begin="1" end="0" resetval="0x0" description="Active Counter-Compare A [CMPA] Load From Shadow Select Mode  This bit has no effect in immediate mode [CMPCTL[SHDWAMODE] = 1].   00: Load on CTR = Zero: Time-base counter equal to zero [TBCTR = 0x0000]  01: Load on CTR = PRD: Time-base counter equal to period [TBCTR = TBPRD]  10: Load on either CTR = Zero or CTR = PRD  11: Freeze [no loads possible]" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM28_CMPCTL2" acronym="CONTROLSS_G2_EPWM28_CMPCTL2" offset="0x12" width="16" description="Counter Compare Control Register 2">
		<bitfield id="LOADDSYNC" width="2" begin="13" end="12" resetval="0x0" description="Shadow to Active CMPD Register Load on SYNC event   00: Shadow to Active Load of CMPD occurs according to LOADDMODE  01: Shadow to Active Load of CMPD occurs both according to LOADDMODE bits and when SYNC occurs  10: Shadow to Active Load of CMPD occurs only when a SYNC is received  11: Reserved  Note: This bit is valid only if CMPCTL2[SHDWDMODE] = 0." range="13 - 12" rwaccess="R/W"/> 
		<bitfield id="LOADCSYNC" width="2" begin="11" end="10" resetval="0x0" description="Shadow to Active CMPC Register Load on SYNC event   00: Shadow to Active Load of CMPC occurs according to LOADCMODE  01: Shadow to Active Load of CMPC occurs both according to LOADCMODE bits and when SYNC occurs  10: Shadow to Active Load of CMPC occurs only when a SYNC is received  11: Reserved  Note: This bit is valid only if CMPCTL2[SHDWCMODE] = 0." range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="SHDWDMODE" width="1" begin="6" end="6" resetval="0x0" description="Counter-Compare D Register Operating Mode   0: Shadow mode - operates as a double buffer. All writes via the CPU access Shadow register.  1: Immediate mode - only the Active compare register is used. All writes/reads via the CPU directly access the Active register for immediate Compare action." range="6" rwaccess="R/W"/> 
		<bitfield id="SHDWCMODE" width="1" begin="4" end="4" resetval="0x0" description="Counter-Compare C Register Operating Mode   0: Shadow mode - operates as a double buffer. All writes via the CPU access Shadow register.  1: Immediate mode - only the Active compare register is used. All writes/reads via the CPU directly access the Active register for immediate Compare action." range="4" rwaccess="R/W"/> 
		<bitfield id="LOADDMODE" width="2" begin="3" end="2" resetval="0x0" description="Active Counter-Compare D [CMPD] Load from Shadow Select Mode   00: Load on CTR = Zero: Time-base counter equal to zero [TBCTR = 0x0000]  01: Load on CTR = PRD: Time-base counter equal to period [TBCTR = TBPRD]  10: Load on either CTR = Zero or CTR = PRD  11: Freeze [no loads possible]  Note: Has no effect in Immediate mode." range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="LOADCMODE" width="2" begin="1" end="0" resetval="0x0" description="Active Counter-Compare C [CMPC] Load from Shadow Select Mode   00: Load on CTR = Zero: Time-base counter equal to zero [TBCTR = 0x0000]  01: Load on CTR = PRD: Time-base counter equal to period [TBCTR = TBPRD]  10: Load on either CTR = Zero or CTR = PRD  11: Freeze [no loads possible]  Note: Has no effect in Immediate mode." range="1 - 0" rwaccess="R/W"/>
	</register>
