IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G2_EPWM28_CONTROLSS_G2_EPWM28.xml
	<register id="CONTROLSS_G2_EPWM28_XCMP6_SHDW1" acronym="CONTROLSS_G2_EPWM28_XCMP6_SHDW1" offset="0x694" width="32" description="Additional Compare 6 Shadow 1 Register">
		<bitfield id="XCMP6_SHDW1" width="16" begin="31" end="16" resetval="0x0" description="XCMP6_SHDW1 Register The value in the XCMP6_SHDW1 register is loaded into XCMP6_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP6HR_SHDW1" width="16" begin="15" end="0" resetval="0x0" description="XCMP6HR_SHDW1 Register  The value in the XCMP6HR_SHDW1 register is loaded into XCMP6HR_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM28_XCMP7_SHDW1" acronym="CONTROLSS_G2_EPWM28_XCMP7_SHDW1" offset="0x698" width="32" description="Additional Compare 7 Shadow 1 Register">
		<bitfield id="XCMP7_SHDW1" width="16" begin="31" end="16" resetval="0x0" description="XCMP7_SHDW1 Register The value in the XCMP7_SHDW1 register is loaded into XCMP7_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP7HR_SHDW1" width="16" begin="15" end="0" resetval="0x0" description="XCMP7HR_SHDW1 Register  The value in the XCMP7HR_SHDW1 register is loaded into XCMP7HR_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM28_XCMP8_SHDW1" acronym="CONTROLSS_G2_EPWM28_XCMP8_SHDW1" offset="0x69C" width="32" description="Additional Compare 8 Shadow 1 Register">
		<bitfield id="XCMP8_SHDW1" width="16" begin="31" end="16" resetval="0x0" description="XCMP8_SHDW1 Register The value in the XCMP8_SHDW1 register is loaded into XCMP8_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP8HR_SHDW1" width="16" begin="15" end="0" resetval="0x0" description="XCMP8HR_SHDW1 Register  The value in the XCMP8HR_SHDW1 register is loaded into XCMP8HR_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM28_XTBPRD_SHDW1" acronym="CONTROLSS_G2_EPWM28_XTBPRD_SHDW1" offset="0x6A0" width="32" description="Additional Time Base Period Shadow 1 Register">
		<bitfield id="XTBPRD_SHDW1" width="16" begin="31" end="16" resetval="0x0" description="The value in the XTBPRD_SHDW1 register is loaded into XTBPRD_ ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XTBPRDHR_SHDW1" width="16" begin="15" end="0" resetval="0x0" description="The value in the XTBPRDHR_SHDW1 register is loaded into XTBPRDHR_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM28_XAQCTLA_SHDW1" acronym="CONTROLSS_G2_EPWM28_XAQCTLA_SHDW1" offset="0x6B0" width="16" description="XAQCTLA Shadow 1 Register">
		<bitfield id="XCMP8" width="2" begin="15" end="14" resetval="0x0" description="Action when Counter = CMP8 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="15 - 14" rwaccess="R/W"/> 
		<bitfield id="XCMP7" width="2" begin="13" end="12" resetval="0x0" description="Action when Counter = CMP7 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="13 - 12" rwaccess="R/W"/> 
		<bitfield id="XCMP6" width="2" begin="11" end="10" resetval="0x0" description="Action when Counter = CMP6 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="XCMP5" width="2" begin="9" end="8" resetval="0x0" description="Action when Counter = CMP5 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="XCMP4" width="2" begin="7" end="6" resetval="0x0" description="Action when Counter = CMP4 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="XCMP3" width="2" begin="5" end="4" resetval="0x0" description="Action when Counter = CMP3 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="XCMP2" width="2" begin="3" end="2" resetval="0x0" description="Action when Counter = CMP2 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="XCMP1" width="2" begin="1" end="0" resetval="0x0" description="Action when Counter = CMP1 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM28_XAQCTLB_SHDW1" acronym="CONTROLSS_G2_EPWM28_XAQCTLB_SHDW1" offset="0x6B2" width="16" description="XAQCTLB Shadow 1 Register">
		<bitfield id="XCMP8" width="2" begin="15" end="14" resetval="0x0" description="Action when Counter = CMP8 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="15 - 14" rwaccess="R/W"/> 
		<bitfield id="XCMP7" width="2" begin="13" end="12" resetval="0x0" description="Action when Counter = CMP7 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="13 - 12" rwaccess="R/W"/> 
		<bitfield id="XCMP6" width="2" begin="11" end="10" resetval="0x0" description="Action when Counter = CMP6 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="XCMP5" width="2" begin="9" end="8" resetval="0x0" description="Action when Counter = CMP5 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="9 - 8" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM28_CMPC_SHDW1" acronym="CONTROLSS_G2_EPWM28_CMPC_SHDW1" offset="0x6BA" width="16" description="CMPC Shadow 1 Register">
		<bitfield id="CMPC_SHDW1" width="16" begin="15" end="0" resetval="0x0" description="The value in the CMPC_SHDW1 register is loaded into CMPC_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM28_CMPD_SHDW1" acronym="CONTROLSS_G2_EPWM28_CMPD_SHDW1" offset="0x6BE" width="16" description="CMPD Shadow 1 Register">
		<bitfield id="CMPD_SHDW1" width="16" begin="15" end="0" resetval="0x0" description="The value in the CMPD_SHDW1 register is loaded into CMPD_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM28_XMINMAX_SHDW1" acronym="CONTROLSS_G2_EPWM28_XMINMAX_SHDW1" offset="0x6C4" width="32" description="XMINMAX Shadow 1 Register">
		<bitfield id="XMIN_SHDW1" width="16" begin="31" end="16" resetval="0x0" description="The value in the XMIN_SHDW1 register is loaded into XMIN_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XMAX_SHDW1" width="16" begin="15" end="0" resetval="0x0" description="The value in the XMAX_SHDW1 register is loaded into XMAX_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
