IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G2_EPWM28_CONTROLSS_G2_EPWM28.xml
	<register id="CONTROLSS_G2_EPWM28_XCMP1_SHDW2" acronym="CONTROLSS_G2_EPWM28_XCMP1_SHDW2" offset="0x700" width="32" description="Additional Compare 1 Shadow 2 Register">
		<bitfield id="XCMP1_SHDW2" width="16" begin="31" end="16" resetval="0x0" description="XCMP1_SHDW2 Register The value in the XCMP1_SHDW2 register is loaded into XCMP1_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP1HR_SHDW2" width="16" begin="15" end="0" resetval="0x0" description="XCMP1HR_SHDW2 Register  The value in the XCMP1HR_SHDW2 register is loaded into XCMP1HR_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM28_XCMP2_SHDW2" acronym="CONTROLSS_G2_EPWM28_XCMP2_SHDW2" offset="0x704" width="32" description="Additional Compare 2 Shadow 2 Register">
		<bitfield id="XCMP2_SHDW2" width="16" begin="31" end="16" resetval="0x0" description="XCMP2_SHDW2 Register The value in the XCMP2_SHDW2 register is loaded into XCMP2_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP2HR_SHDW2" width="16" begin="15" end="0" resetval="0x0" description="XCMP2HR_SHDW2 Register  The value in the XCMP2HR_SHDW2 register is loaded into XCMP2HR_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM28_XCMP3_SHDW2" acronym="CONTROLSS_G2_EPWM28_XCMP3_SHDW2" offset="0x708" width="32" description="Additional Compare 3 Shadow 2 Register">
		<bitfield id="XCMP3_SHDW2" width="16" begin="31" end="16" resetval="0x0" description="XCMP3_SHDW2 Register The value in the XCMP3_SHDW2 register is loaded into XCMP3_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP3HR_SHDW2" width="16" begin="15" end="0" resetval="0x0" description="XCMP3HR_SHDW2 Register  The value in the XCMP3HR_SHDW2 register is loaded into XCMP3HR_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM28_XCMP4_SHDW2" acronym="CONTROLSS_G2_EPWM28_XCMP4_SHDW2" offset="0x70C" width="32" description="Additional Compare 4 Shadow 2 Register">
		<bitfield id="XCMP4_SHDW2" width="16" begin="31" end="16" resetval="0x0" description="XCMP4_SHDW2 Register The value in the XCMP4_SHDW2 register is loaded into XCMP4_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP4HR_SHDW2" width="16" begin="15" end="0" resetval="0x0" description="XCMP4HR_SHDW2 Register  The value in the XCMP4HR_SHDW2 register is loaded into XCMP4HR_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM28_XCMP5_SHDW2" acronym="CONTROLSS_G2_EPWM28_XCMP5_SHDW2" offset="0x710" width="32" description="Additional Compare 5 Shadow 2 Register">
		<bitfield id="XCMP5_SHDW2" width="16" begin="31" end="16" resetval="0x0" description="XCMP5_SHDW2 Register The value in the XCMP5_SHDW2 register is loaded into XCMP5_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP5HR_SHDW2" width="16" begin="15" end="0" resetval="0x0" description="XCMP5HR_SHDW2 Register  The value in the XCMP5HR_SHDW2 register is loaded into XCMP5HR_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM28_XCMP6_SHDW2" acronym="CONTROLSS_G2_EPWM28_XCMP6_SHDW2" offset="0x714" width="32" description="Additional Compare 6 Shadow 2 Register">
		<bitfield id="XCMP6_SHDW2" width="16" begin="31" end="16" resetval="0x0" description="XCMP6_SHDW2 Register The value in the XCMP6_SHDW2 register is loaded into XCMP6_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP6HR_SHDW2" width="16" begin="15" end="0" resetval="0x0" description="XCMP6HR_SHDW2 Register  The value in the XCMP6HR_SHDW2 register is loaded into XCMP6HR_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM28_XCMP7_SHDW2" acronym="CONTROLSS_G2_EPWM28_XCMP7_SHDW2" offset="0x718" width="32" description="Additional Compare 7 Shadow 2 Register">
		<bitfield id="XCMP7_SHDW2" width="16" begin="31" end="16" resetval="0x0" description="XCMP7_SHDW2 Register The value in the XCMP7_SHDW2 register is loaded into XCMP7_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP7HR_SHDW2" width="16" begin="15" end="0" resetval="0x0" description="XCMP7HR_SHDW2 Register  The value in the XCMP7HR_SHDW2 register is loaded into XCMP7HR_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM28_XCMP8_SHDW2" acronym="CONTROLSS_G2_EPWM28_XCMP8_SHDW2" offset="0x71C" width="32" description="Additional Compare 8 Shadow 2 Register">
		<bitfield id="XCMP8_SHDW2" width="16" begin="31" end="16" resetval="0x0" description="XCMP8_SHDW2 Register The value in the XCMP8_SHDW2 register is loaded into XCMP8_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP8HR_SHDW2" width="16" begin="15" end="0" resetval="0x0" description="XCMP8HR_SHDW2 Register  The value in the XCMP8HR_SHDW2 register is loaded into XCMP8HR_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM28_XTBPRD_SHDW2" acronym="CONTROLSS_G2_EPWM28_XTBPRD_SHDW2" offset="0x720" width="32" description="Additional Time Base Period Shadow 2 Register">
		<bitfield id="XTBPRD_SHDW2" width="16" begin="31" end="16" resetval="0x0" description="The value in the XTBPRD_SHDW2 register is loaded into XTBPRD_ ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XTBPRDHR_SHDW2" width="16" begin="15" end="0" resetval="0x0" description="The value in the XTBPRDHR_SHDW2 register is loaded into XTBPRDHR_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM28_XAQCTLA_SHDW2" acronym="CONTROLSS_G2_EPWM28_XAQCTLA_SHDW2" offset="0x730" width="16" description="XAQCTLA Shadow 2 Register">
		<bitfield id="XCMP8" width="2" begin="15" end="14" resetval="0x0" description="Action when Counter = CMP8 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="15 - 14" rwaccess="R/W"/> 
		<bitfield id="XCMP7" width="2" begin="13" end="12" resetval="0x0" description="Action when Counter = CMP7 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="13 - 12" rwaccess="R/W"/> 
		<bitfield id="XCMP6" width="2" begin="11" end="10" resetval="0x0" description="Action when Counter = CMP6 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="XCMP5" width="2" begin="9" end="8" resetval="0x0" description="Action when Counter = CMP5 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="XCMP4" width="2" begin="7" end="6" resetval="0x0" description="Action when Counter = CMP4 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="XCMP3" width="2" begin="5" end="4" resetval="0x0" description="Action when Counter = CMP3 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="XCMP2" width="2" begin="3" end="2" resetval="0x0" description="Action when Counter = CMP2 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="XCMP1" width="2" begin="1" end="0" resetval="0x0" description="Action when Counter = CMP1 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM28_XAQCTLB_SHDW2" acronym="CONTROLSS_G2_EPWM28_XAQCTLB_SHDW2" offset="0x732" width="16" description="XAQCTLB Shadow 2 Register">
		<bitfield id="XCMP8" width="2" begin="15" end="14" resetval="0x0" description="Action when Counter = CMP8 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="15 - 14" rwaccess="R/W"/> 
		<bitfield id="XCMP7" width="2" begin="13" end="12" resetval="0x0" description="Action when Counter = CMP7 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="13 - 12" rwaccess="R/W"/> 
		<bitfield id="XCMP6" width="2" begin="11" end="10" resetval="0x0" description="Action when Counter = CMP6 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="XCMP5" width="2" begin="9" end="8" resetval="0x0" description="Action when Counter = CMP5 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="9 - 8" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM28_CMPC_SHDW2" acronym="CONTROLSS_G2_EPWM28_CMPC_SHDW2" offset="0x73A" width="16" description="CMPC Shadow 2 Register">
		<bitfield id="CMPC_SHDW2" width="16" begin="15" end="0" resetval="0x0" description="The value in the CMPC_SHDW2 register is loaded into CMPC_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM28_CMPD_SHDW2" acronym="CONTROLSS_G2_EPWM28_CMPD_SHDW2" offset="0x73E" width="16" description="CMPD Shadow 2 Register">
		<bitfield id="CMPD_SHDW2" width="16" begin="15" end="0" resetval="0x0" description="The value in the CMPD_SHDW2 register is loaded into CMPD_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM28_XMINMAX_SHDW2" acronym="CONTROLSS_G2_EPWM28_XMINMAX_SHDW2" offset="0x744" width="32" description="XMINMAX Shadow 2 Register">
		<bitfield id="XMIN_SHDW2" width="16" begin="31" end="16" resetval="0x0" description="The value in the XMIN_SHDW2 register is loaded into XMIN_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XMAX_SHDW2" width="16" begin="15" end="0" resetval="0x0" description="The value in the XMAX_SHDW2 register is loaded into XMAX_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM28_XCMP1_SHDW3" acronym="CONTROLSS_G2_EPWM28_XCMP1_SHDW3" offset="0x780" width="32" description="Additional Compare 1 Shadow 3 Register">
		<bitfield id="XCMP1_SHDW3" width="16" begin="31" end="16" resetval="0x0" description="XCMP1_SHDW3 Register The value in the XCMP1_SHDW3 register is loaded into XCMP1_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP1HR_SHDW3" width="16" begin="15" end="0" resetval="0x0" description="XCMP1HR_SHDW3 Register  The value in the XCMP1HR_SHDW3 register is loaded into XCMP1HR_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM28_XCMP2_SHDW3" acronym="CONTROLSS_G2_EPWM28_XCMP2_SHDW3" offset="0x784" width="32" description="Additional Compare 2 Shadow 3 Register">
		<bitfield id="XCMP2_SHDW3" width="16" begin="31" end="16" resetval="0x0" description="XCMP2_SHDW3 Register The value in the XCMP2_SHDW3 register is loaded into XCMP2_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP2HR_SHDW3" width="16" begin="15" end="0" resetval="0x0" description="XCMP2HR_SHDW3 Register  The value in the XCMP2HR_SHDW3 register is loaded into XCMP2HR_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
